Управление_торговлей.ПБТ/src/DataProcessors/ФормированиеАктовОтбора/ФормированиеАктовОтбора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ФормированиеАктовОтбора</name>
  <tabularSections>
    <name>ТЧ</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСменыЗамеса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидИсследований</name>
      <type>
        <types>CatalogRef.ВидыИсследований</types>
      </type>
    </attributes>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРеализации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МассаОбразца</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ППК</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаДляПоказателейВТУ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МЛ</name>
      <type>
        <types>DocumentRef.МаршрутныйЛист</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Исп</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Управление_торговлей.ПБТ/src/Enums/ПериодичностьЛаб/ПериодичностьЛаб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПериодичностьЛаб</name>
  <enumValues>
    <name>Ежегодно</name>
  </enumValues>
  <enumValues>
    <name>Ежеквартально</name>
  </enumValues>
  <enumValues>
    <name>Ежемесячно</name>
  </enumValues>
  <enumValues>
    <name>Еженедельно</name>
  </enumValues>
  <enumValues>
    <name>КаждаяПартия</name>
  </enumValues>
  <enumValues>
    <name>РазВДваМесяца</name>
  </enumValues>
  <enumValues>
    <name>КаждыйЗамес</name>
  </enumValues>
  <enumValues>
    <name>ППК</name>
  </enumValues>
  <enumValues>
    <name>ПриСменеПоставщикаИлиПроизводителя</name>
  </enumValues>
</mdclass:Enum>

Управление_торговлей.ПБТ/src/Documents/МаршрутныйЛист/МаршрутныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаршрутныйЛист</name>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Линия</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Линии</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСменыЗамеса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗамеса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопМаркировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокЗакладки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяСмешивания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фасовка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФакт</name>
    <comment>Дата фактического производства</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРеализации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БезПотерь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Рецепт</name>
    <type>
      <types>CatalogRef.вт_ВариантыПроизводстваПоТехКартам</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаНоменклатуры</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПродукции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСырья</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рецептурщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыМаршрутныхЛистов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиТЧПлан</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыИсследований</name>
    <attributes>
      <name>ВидИсследований</name>
      <type>
        <types>CatalogRef.ВидыИсследований</types>
      </type>
    </attributes>
    <attributes>
      <name>Лаборатория</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>МассаОбразца</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>EnumRef.ПериодичностьЛаб</types>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыПлан</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество100</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиПлан</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Разница</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Допуск</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/Catalogs/ВидыИсследований/ВидыИсследований.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыИсследований</name>
  <attributes>
    <name>ПрефиксНумерации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МассаОбразца</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.ПериодичностьЛаб</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокВывода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Управление_торговлей.ПБТ/src/DataProcessors/ФормированиеАктовОтбора/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗаполнитьПродукциюНаСервере()
	
	Объект.Продукция.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	МаршрутныйЛист.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	Документ.МаршрутныйЛист КАК МаршрутныйЛист
	               |ГДЕ
	               |	МаршрутныйЛист.Дата МЕЖДУ &НачПериода И &КонПериода
	               |	И НЕ МаршрутныйЛист.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("НачПериода", НачалоДня(ДатаМаршрутных));
	Запрос.УстановитьПараметр("КонПериода", КонецДня(ДатаМаршрутных));	
	
	//Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НовСтр = Объект.Продукция.Добавить();
		НовСтр.Номенклатура = Выборка.Номенклатура;
		НовСтр.Исп = Ложь;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПродукцию(Команда)
	ЗаполнитьПродукциюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВсе(Команда)
	
	ИзменитьВсеНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьВсеНаСервере()
	
	Для каждого Стр Из Объект.Продукция Цикл
		Стр.Исп = НЕ Стр.Исп;
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧНаСервере()
	
	Объект.ТЧ.Очистить();
	
	СЗНужнойНом = Новый СписокЗначений;
	Для каждого СтрПрод Из Объект.Продукция Цикл
		Если СтрПрод.Исп Тогда
			СЗНужнойНом.Добавить(СтрПрод.Номенклатура);
		КонецЕсли; 
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МаршрутныйЛистПродукция.Номенклатура КАК Номенклатура,
	               |	МаршрутныйЛистПродукция.Серия КАК Серия,
	               |	МаршрутныйЛистПродукция.НомерЗамеса КАК НомерСменыЗамеса,
	               |	МаршрутныйЛистВидыИсследований.ВидИсследований КАК ВидИсследований,
	               |	МаршрутныйЛистВидыИсследований.МассаОбразца КАК МассаОбразца,
	               |	МаршрутныйЛистПродукция.Ссылка.Линия КАК Линия,
	               |	МаршрутныйЛистПродукция.ХарактеристикаНоменклатуры КАК Характеристика,
	               |	МаршрутныйЛистПродукция.Ссылка.ДатаРеализации КАК СсылкаДатаРеализации,
	               |	МаршрутныйЛистВидыИсследований.Периодичность КАК Периодичность,
	               |	МаршрутныйЛистПродукция.Ссылка КАК МЛ
	               |ИЗ
	               |	Документ.МаршрутныйЛист КАК МаршрутныйЛистПродукция
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛист.ВидыИсследований КАК МаршрутныйЛистВидыИсследований
	               |		ПО МаршрутныйЛистПродукция.Ссылка = МаршрутныйЛистВидыИсследований.Ссылка
	               |ГДЕ
	               |	МаршрутныйЛистПродукция.Дата МЕЖДУ &НачПериода И &КонПериода
	               |	И НЕ МаршрутныйЛистПродукция.ПометкаУдаления
	               |	И МаршрутныйЛистПродукция.Номенклатура В(&Номенклатура)
	               |	И НЕ МаршрутныйЛистВидыИсследований.ВидИсследований В (&ВидИсследованийНеБрать)
	               |	И МаршрутныйЛистПродукция.Организация = &Организация
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	МаршрутныйЛистПродукция.Номенклатура,
	               |	МаршрутныйЛистПродукция.Серия,
	               |	МаршрутныйЛистПродукция.НомерЗамеса,
	               |	МаршрутныйЛистВидыИсследований.ВидИсследований,
	               |	МаршрутныйЛистВидыИсследований.МассаОбразца,
	               |	МаршрутныйЛистПродукция.Ссылка.Линия,
	               |	МаршрутныйЛистПродукция.ХарактеристикаНоменклатуры,
	               |	МаршрутныйЛистПродукция.Ссылка.ДатаРеализации,
	               |	МаршрутныйЛистВидыИсследований.Периодичность,
	               |	МаршрутныйЛистПродукция.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Линия,
	               |	Номенклатура,
	               |	Серия,
	               |	НомерСменыЗамеса
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("НачПериода", НачалоДня(ДатаМаршрутных));
	Запрос.УстановитьПараметр("КонПериода", КонецДня(ДатаМаршрутных));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Номенклатура", СЗНужнойНом);
	ВидИсследованийНеБрать = Новый СписокЗначений;
	ВидИсследованийНеБрать.Добавить(Справочники.ВидыИсследований.ПредопределенныйЭлемент("Статистика"));
	Запрос.УстановитьПараметр("ВидИсследованийНеБрать", ВидИсследованийНеБрать);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НовСтрТЧ = Объект.ТЧ.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрТЧ, Выборка);
		НовСтрТЧ.Использовать = Истина;
		////инц  0005013 должны попадать еще и артикулы
		//ТекХар = Выборка.Характеристика; 
		//Если ЗначениеЗаполнено(ТекХар) Тогда
		//	Свойство = ФормированиеПечатныхФорм.ПолучитьСвойствоПоЗначениюХарактеристики(ТекХар);
		//	Если ЗначениеЗаполнено(Свойство) Тогда
		//		Если Свойство.Код = "ФизЛицо07" Тогда
		//			НовСтрТЧ.Комментарий = ""+ТекХар;
		//		КонецЕсли; 
		//	КонецЕсли; 
		//КонецЕсли;
		//
		////0021515
		Если Выборка.Периодичность = Перечисления.ПериодичностьЛаб.ППК Тогда
		    НовСтрТЧ.ППК = Истина;
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьТЧ(Команда)
	ЗаполнитьТЧНаСервере();
КонецПроцедуры


&НаСервере
Процедура СоздатьАктыОтбораНаСервере()
	
	ТекстОшибки = "";
	ТекНомерПартии = "";
	ТекНомерСменыЗамеса = "";
	
	Производитель = Справочники.Контрагенты.НайтиПоКоду("001014");
	
	Для каждого СТрТЧ Из ОБъект.ТЧ Цикл
		
		Если НЕ СТрТЧ.Использовать Тогда
			Продолжить;
		КонецЕсли; 
		
		//акт отбора
		Если (НЕ ТекНомерПартии = СТрТЧ.Серия) ИЛИ (НЕ ТекНомерСменыЗамеса = СТрТЧ.НомерСменыЗамеса) Тогда
			ТекНомерПартии = СТрТЧ.Серия;
			ТекНомерСменыЗамеса = СТрТЧ.НомерСменыЗамеса;
			
			ДокАктОтб = Документы.АктОтбора.СоздатьДокумент();
			ДокАктОтб.Дата = ТекущаяДатаСеанса();
			ДокАктОтб.ДатаСоздания = ТекущаяДатаСеанса();
			
			ДокАктОтб.Организация = Организация;
			ДокАктОтб.Пользователь = Пользователи.ТекущийПользователь();
			
			ДокАктОтб.Комментарий = СТрТЧ.Комментарий;
			ДокАктОтб.ППК = СТрТЧ.ППК;  
			
			НовСтрАкта = ДокАктОтб.ТЧ_Образцы.Добавить();
			
			НовСтрАкта.ДатаПоступленияНаСклад = ДокАктОтб.Дата;
			//НовСтрАкта.ЕдиницаИзмерения = ЕдИзмер;
			НовСтрАкта.Количество = 0;
			НовСтрАкта.ДокументОснование = СТрТЧ.МЛ;
			
			ДокАктОтб.Номенклатура = СТрТЧ.Номенклатура;
			НовСтрАкта.ДатаРеализации = СТрТЧ.ДатаРеализации;
			 
			НовСтрАкта.НомерЗамеса = СТрТЧ.НомерСменыЗамеса;
			НовСтрАкта.Серия = СТрТЧ.Серия;
			НовСтрАкта.ДатаИзготовления = ДатаМаршрутных;
			
			//НовСтрАкта.СрокГодности = ЛабораторияКлиент.ПолучитьСрокГодности(СТрТЧ.Номенклатура, ДатаМаршрутных);//ЛАБ_Номенклатура.срокГодности;
			//НовСтрАкта.Производитель = ЛАБ_Номенклатура.Производитель;
			НовСтрАкта.Производитель = Производитель;
			НовСтрАкта.ПометкаОбОтбореАрбитражногоОбразца = Истина;
			//НовСтрАкта.КодПродукта = 1;
			НовСтрАкта.ИдентификаторСтрОбразцы = Новый УникальныйИдентификатор;
		КонецЕсли;
		
		НовСтрВидИс = ДокАктОтб.ТЧ_ВидыИсследований.ДОбавить();
		НазвИсс = СокрЛП(СТрТЧ.ВидИсследований.Наименование);
		НовСтрВидИс.ВидИсследования = СТрТЧ.ВидИсследований;//Справочники.ВидыИсследований.НайтиПоНаименованию(НазвИсс, Истина);
		НовСтрВидИс.МассаОбразца = СТрТЧ.МассаОбразца;
		НовСтрВидИс.Количество = 1;
		НовСтрВидИс.Лаборатория = Лаборатория;
		НовСтрВидИс.ИдентификаторСтрокиТЧОбразцы = НовСтрАкта.ИдентификаторСтрОбразцы;
		НовСтрАкта.Количество = НовСтрАкта.Количество+1;
		
		Попытка
			ДокАктОтб.Записать();
			ТекстОшибки = ТекстОшибки +Символы.ПС+"Записан акт отбора "+ ДокАктОтб.Номер;
		Исключение
			ТекстОшибки = ТекстОшибки +Символы.ПС+ОписаниеОшибки();
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьАктыОтбора(Команда)
	СоздатьАктыОтбораНаСервере();
КонецПроцедуры
